# -*- coding: utf-8 -*-
"""numpy_challenge_upd.py

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1XHEJneVVUSc4H8NSkeE70HMY8rG5f5Rc

### 1 Cоздать 3 ваших любимых эррея разными способами
"""

import numpy as np

#1 преобразовать список в массив нампай
food = ['banana', 'coffee', 'tiramisu', 'pasta', 'pizza']
food = np.array(food)

food

#2 cделать массив через np.arange

birthdays_days = np.arange(2,100, 12)

birthdays_days

#3 Создать с нуля массив нампай
family = np.array(['Masha', 'Varya', 'Papa', 'Mama', 'Babuska', 'Dedushka', 'Dyada Yura'])

family

"""## 2. Функция для проверки возможности умножения матриц

## здесь поправить функцию: она должна учитывать список из n-элементов: - поправила

*   Код сильно перегружен
*   Не обязательно каждый раз вызывать np.array, если это можно сделать один раз
*   Функция возвращает логический тип, поэтому уловия тут лишние
*   В 38 и 44 строках ты проверяешь размер матриц, но почему-то делаешь это по-разному
"""

def multiplication_check(matrix_list):
  for i in range(len(matrix_list) - 1):
    matrixes = matrix_list[i:i+2]
    matrix1 = np.array(matrixes[0]) #матрица 1 из массива
    matrix2 = np.array(matrixes[1]) #матрица 2 из массива
    
    #умножение двух неодномерных или первого неодномерного и второго одномерного
    if (np.array(matrix1).ndim != 1 and np.array(matrix2).ndim != 1) or (np.array(matrix1).ndim != 1 and np.array(matrix2).ndim == 1):
      return np.shape(matrix1)[1] ==  np.shape(matrix2)[0]

     #когда первый одномерный, а второй неодномерный
    elif np.array(matrix1).ndim == 1 and np.array(matrix2).ndim != 1:
      return np.shape(matrix1)[0] == np.shape(matrix2)[0]
    
    #когда оба одномерные
    elif np.array(matrix1).ndim == 1 and np.array(matrix2).ndim == 1:
      return matrix1.size == 1 and matrix2.size == 1

multiplication_check([[[1,2,2],[2,3,2],[1,2,3]],[13,1,3]])

"""## 3. Функция для умножения - поправила
здесь: - поправлено
* поправить отступы 
* убрать везде np.array
"""

def matrix_multiplication(matrix1,matrix2):
    matrix1_np = np.array(matrix1)
    if multiplication_check([matrix1_np, matrix2]) == True:
      product = matrix1_np.dot(np.array(matrix2))
      return product
    else:
      print('The matrices cannot be multiplied')

matrix_multiplication([[1,2,4],[1,3,4]],[12,4,4])

matrix_multiplication([1,2],[1,3])

matrix_multiplication([[1,2,4],[1,3,4]],[12,4,4])

"""## 4. Функция для проверки списка матриц - поправила"""

def multiply_matrices(matrixes):

  if multiplication_check(matrixes): #если весь список матриц проходит проверку
    product = np.array(1)
    for i in range(len(matrixes) - 1):
      result = matrix_multiplication(matrixes[i], matrixes[i+1]) #попарное перемножение 
      product = product.dot(result) #последовательное умножение подобных матриц-результатов умножения для получения итога
  else:
    product = None

  return product

multiply_matrices([[[1,2,4],[1,3,4]],[12,4,4]])

"""## 5. Функция для подсчета расстояний между двумя точками в двумерном пространстве

👍
"""

def compute_2d_distance(point1, point2):
  a = np.array(point1)
  b = np.array(point2)
  distance = np.linalg.norm(a - b)
  return distance

"""## 6. Функция для подсчета расстояний между двумя точками в n-мерном пространстве

👍
"""

def compute_multidimensional_distance(point1, point2):
  if len(point1) == len(point2):
    a_mult = np.array(point1)
    b_mult = np.array(point2)
    distance = np.linalg.norm(a_mult - b_mult)
    return distance
  else:
    print('the matrixes should have the same number of elements')

"""## 7. Функция для подсчета расстояний в двумерном массиве

👍
"""

def compute_pair_distances(matrix):
  matrix_arr = np.array(matrix)
  n = matrix_arr.shape[0]
  distances = np.zeros((n,n))
  for i in range(n):
    for j in range(n):
      distances[i][j] = np.linalg.norm(matrix_arr[i] - matrix_arr[j])

  return distances